# "================================================="
print("==============실습1=================")

count = 3
temp = 36.5
name = "센서"
ok = True

print(count, temp, name, ok)

# "================================================="
print("==============실습2=================")

count = 3
temp = 36.5
name = "센서"
ok = True

print(type(count))
print(type(temp))
print(type(name))
print(type(ok))


# "================================================="
print("==============실습3=================")

print("100 :",type(100)) # 100 : class int
print("100.0 :", type(100.0)) # 100.0 : class float
print('"100" :', type("100")) # "100" : class str

# "================================================="
print("==============실습4=================")

print(3+4) # 7
print("3"+"4") # 34
print("34" + "56") # 3456

# "================================================="
print("==============실습5=================")

print(3>2) #True
print(5 == 5) #True
print(type(5 == 5)) # class bool

# "================================================="
print("==============실습6=================")

count = 3
print("count :", type(count)) # count : int
temp = 36.5
print("temp :", type(temp)) # type : float
name = "센서"
print("name :", type(name))

# "================================================="
print("==============실습7=================")

device_temp = 25.5 
check_count = 5
device_name = "갤럭시"
is_normal = False

# "================================================="