# "=========================================================
print("=============실습 1============")

name = input("이름 : ") # 이름 : 홍길동
print("안녕하세요",name + "님!") # 안녕하세요 홍길동님!

# "=========================================================
print("=============실습 2============")

birth_year = int(input("태어난 해를 입력하세요 :")) # 1900
age = 2026 - birth_year + 1
print("나이 :",age,"세") # 127세

# "=========================================================
print("=============실습 3============")

country = str(input("거주 국가 : "))
city = str(input("거주 도시 : "))
print(country + "의", city + "에서 거주하시는군요!")

# "=========================================================
print("=============실습 4============")

a = int(input("숫자1 : ")) # 숫자1 : 6
b = int(input("숫자2 : ")) # 숫자2 : 3
print("덧셈 :", a+b) # 9
print("뺼셈 :", a-b) # 3
print("곱셈 :", a*b) # 18
print("나눗셈 :", a/b) # 2.0

# "=========================================================
print("=============실습 5============")

temp = float(input("온도 : ")) # 50.2
print("80도 초과? :", temp > 80) # False
print("0도 이상?", temp >= 0) # True

# "=========================================================
print("=============실습 6============")

sub_1 = int(input("국어 : ")) # 80
sub_2 = int(input("수학 : ")) # 85
sub_3 = int(input("영어 : ")) # 75
avg = (sub_1 + sub_2 + sub_3) / 3
print("60점 이상? :", avg >= 60) # True

