# "========================================================="
print("============실습============")

# 글자 치환
text = "설비 정상 가동" # 정상 > 점검
text = text.replace("정상","점검")
print(text)

# 연속 치환
text_1 = "      010-1234-5678      "
text_1 = text_1.replace(" ","").replace("-","")
print(text_1)

# "========================================================="
print("============실습============")

text_2 = "a,b,c,d"
text_2 = text_2.split(",")
print(text_2)

# "========================================================="
print("============실습============")

text_3 = "a,b,c,d" 
text_3 = text_3.split(",",1)
print(text_3)

# "========================================================="
print("============실습============")

date = ["2025","01","15"]
print("-".join(date))

# "========================================================="
print("============실습============")

print(2025, 1, 15 , sep="-")
print(2025, 1, 15 , sep=", ")

# "========================================================="
print("============실습============")

date = "2025/07/27"
date_s = date.split("/")
print("-".join(date_s))

date = "2025/07/27"
print("-".join(date.split("/")))

print("============실습============")

text = "1, NORMAL, 25.3"
text_s = text.split(",")
text_l = text_s[1].strip().lower()
print(text_l)

text = "1, NORMAL, 25.3"
print(text.split(",")[1].strip().lower())