# ======================================================
print("==========실습==========")

n = int(input("끝 숫자를 입력하세요 :   "))
for i in range(1, n + 1):
    print(i)
for i in range(1, n + 1, 2):
    print(i)
for i in range(n, 0, -1):
    print(i)

# ======================================================
print("==========실습==========")

n = int(input("끝 숫자를 입력하세요 :   "))
for i in range(1, n):
    if i % 3 == 0:
        print(i, end=" ")

# ======================================================
print("==========실습==========")

for dan in range(2, 6):
    for su in range(1, 10):
        print(dan, "x", su, "=", dan * su)
    print("========")

# ======================================================
print("==========실습==========")

for i in range(2, 10, 2):
    for j in range(1, 10):
        print(i, "x", j, "=", i * j)
    print("=========")
